# 고정비율 투자법 그림 3-10

1. 마음에 드는 우량주 선택(예: 삼성전자)
2. 선정한 종목 매수(단, 투자 자금의 10%만 매수, 나머지 90%는 단기 국고채 ETF에 투자)
3. 매달 마지막 거래일에 주식:국고채 비중 = 1:9 로 리밸런싱
4. 
그림 3-15 코스피지수 변동성 조절 포트폴리오

In [1]:
from settings import *

In [2]:
sec = fdr.DataReader("005930")[['Close']]

In [3]:
sec

            Close
Date
1997-12-19    745
1997-12-20    751
1997-12-22    740
1997-12-23    681
1997-12-24    627
...           ...
2022-01-24  75100
2022-01-25  74000
2022-01-26  73300
2022-01-27  71300
2022-01-28  73300

[6000 rows x 1 columns]

In [4]:
sec['1997-12']

            Close
Date
1997-12-19    745
1997-12-20    751
1997-12-22    740
1997-12-23    681
1997-12-24    627
1997-12-26    677
1997-12-27    686

In [5]:
sec['2021-12'].tail()

            Close
Date
2021-12-24  80500
2021-12-27  80200
2021-12-28  80300
2021-12-29  78800
2021-12-30  78300

In [6]:
s = '1997-12-27'
e = '2021-12-30'

In [7]:
data = pd.DataFrame()
data['SEC'] = sec.copy()
data = data[s:e]
dd = pd.DataFrame()
dd.index = pd.date_range(s, e, freq='D')
denominator = len(pd.date_range(s, e, freq='D'))/len(pd.date_range(s, e, freq='Y'))
dd['현금'] = pow(1.03, 1/denominator)
dd['현금'] = dd['현금'].shift(1, fill_value=1.0)
dd['현금'] = dd['현금'].cumprod()
#%%
data = pd.merge(data, dd, left_index=True, right_index=True, how='left')

In [8]:
data

              SEC    현금
Date
1997-12-27    686 1.000
1998-01-03    735 1.001
1998-01-05    777 1.001
1998-01-06    784 1.001
1998-01-07    799 1.001
...           ...   ...
2021-12-24  80500 2.032
2021-12-27  80200 2.032
2021-12-28  80300 2.032
2021-12-29  78800 2.032
2021-12-30  78300 2.033

[5974 rows x 2 columns]